### DataFrame에서 원소 변경

In [1]:
import pandas as pd

In [2]:
data = {'name':['홍길동', '마징가', '원더우먼'],
        'job':['의적', '로봇', '영웅'],
        'gender':['남', '남', '여'],
        'age':[100, 200, 300],
        'height':[180, 300, 200]}

In [3]:
dataDF = pd.DataFrame(data)

In [4]:
dataDF

   name job gender  age  height
0   홍길동  의적      남  100     180
1   마징가  로봇      남  200     300
2  원더우먼  영웅      여  300     200

- 원소 값 변경

In [5]:
# 홍길동의 성병을 '남'에서 '여'로 변경
# 현재 홍길동의 성별 정보 추출

dataDF.loc[0, 'gender']

'남'

In [6]:
# 남 ==> 여
dataDF.iloc[0, 2] = '여'
dataDF

   name job gender  age  height
0   홍길동  의적      여  100     180
1   마징가  로봇      남  200     300
2  원더우먼  영웅      여  300     200

In [7]:
# 원더우먼의 직업을 '직장인'으로 변경
dataDF.iloc[2, 1] = '직장인'

In [8]:
dataDF

   name  job gender  age  height
0   홍길동   의적      여  100     180
1   마징가   로봇      남  200     300
2  원더우먼  직장인      여  300     200

- 행 전체 값 변경

In [9]:
# 행 정체 선책 => 변수명.iloc[] 또는 변수명.loc[]
# 1번행 추출
dataDF.iloc[1]

name      마징가
job        로봇
gender      남
age       200
height    300
Name: 1, dtype: object

In [12]:
# 1번 행 값 변경 => 컬럼 개수 == 데이터 개수
dataDF.iloc[1] = ['마징가2', '영웅', '여', 90, 170]

In [14]:
dataDF.iloc[1] = 0

In [15]:
dataDF.height = 0

In [16]:
dataDF

   name  job gender  age  height
0   홍길동   의적      여  100       0
1     0    0      0    0       0
2  원더우먼  직장인      여  300       0

In [17]:
# == <= >=